Revit 2017 API
TextElement.GetMinimumAllowedWidth Method (Document, ElementId)
 Returns the minimum width a text element can be created with.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2016
Syntax
C#
public static double GetMinimumAllowedWidth(
	Document cdda,
	ElementId typeId
)
Visual Basic
Public Shared Function GetMinimumAllowedWidth ( _
	cdda As Document, _
	typeId As ElementId _
) As Double
Visual C++
public:
static double GetMinimumAllowedWidth(
	Document^ cdda,
	ElementId^ typeId
)
Parameters
cdda
Type: Autodesk.Revit.DB.Document
 A document containing the new text element's type
typeId
Type: Autodesk.Revit.DB.ElementId
 Id of the text type
Return Value
 The minimum allowed width in paper space [ft].
Remarks
 Note that it is not necessarily a constant; it can be affected by properties of the text type, such as the width factor.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
TextElement Class
GetMinimumAllowedWidth Overload
Autodesk.Revit.DB Namespace